konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/psm.inc
.equ	PSM_DONE_BOOTRAM_MSB, 9
.equ	PSM_DONE_BOOTRAM_LSB, 9
# -----------------------------------------------------------------------------
# Field       : PSM_DONE_ROM
.equ	PSM_DONE_ROM_RESET, 0x0
.equ	PSM_DONE_ROM_BITS, 0x00000100
.equ	PSM_DONE_ROM_MSB, 8
.equ	PSM_DONE_ROM_LSB, 8
# -----------------------------------------------------------------------------
# Field       : PSM_DONE_BUSFABRIC
.equ	PSM_DONE_BUSFABRIC_RESET, 0x0
.equ	PSM_DONE_BUSFABRIC_BITS, 0x00000080
.equ	PSM_DONE_BUSFABRIC_MSB, 7
.equ	PSM_DONE_BUSFABRIC_LSB, 7
# -----------------------------------------------------------------------------
# Field       : PSM_DONE_PSM_READY
.equ	PSM_DONE_PSM_READY_RESET, 0x0
.equ	PSM_DONE_PSM_READY_BITS, 0x00000040
.equ	PSM_DONE_PSM_READY_MSB, 6
.equ	PSM_DONE_PSM_READY_LSB, 6
# -----------------------------------------------------------------------------
# Field       : PSM_DONE_CLOCKS
.equ	PSM_DONE_CLOCKS_RESET, 0x0
.equ	PSM_DONE_CLOCKS_BITS, 0x00000020
.equ	PSM_DONE_CLOCKS_MSB, 5
.equ	PSM_DONE_CLOCKS_LSB, 5
# -----------------------------------------------------------------------------
# Field       : PSM_DONE_RESETS
.equ	PSM_DONE_RESETS_RESET, 0x0
.equ	PSM_DONE_RESETS_BITS, 0x00000010
.equ	PSM_DONE_RESETS_MSB, 4
.equ	PSM_DONE_RESETS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : PSM_DONE_XOSC
.equ	PSM_DONE_XOSC_RESET, 0x0
.equ	PSM_DONE_XOSC_BITS, 0x00000008
.equ	PSM_DONE_XOSC_MSB, 3
.equ	PSM_DONE_XOSC_LSB, 3
# -----------------------------------------------------------------------------
# Field       : PSM_DONE_ROSC
.equ	PSM_DONE_ROSC_RESET, 0x0
.equ	PSM_DONE_ROSC_BITS, 0x00000004
.equ	PSM_DONE_ROSC_MSB, 2
.equ	PSM_DONE_ROSC_LSB, 2
# -----------------------------------------------------------------------------
# Field       : PSM_DONE_OTP
.equ	PSM_DONE_OTP_RESET, 0x0
.equ	PSM_DONE_OTP_BITS, 0x00000002
.equ	PSM_DONE_OTP_MSB, 1
.equ	PSM_DONE_OTP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : PSM_DONE_PROC_COLD
.equ	PSM_DONE_PROC_COLD_RESET, 0x0
.equ	PSM_DONE_PROC_COLD_BITS, 0x00000001
.equ	PSM_DONE_PROC_COLD_MSB, 0
.equ	PSM_DONE_PROC_COLD_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_PSM_H
